app/Models/AuthModel.php

SELECT *
FROM `tbl_admin`
WHERE `email` = 'test@yopmail.com'
AND `status` = 1
---
    public function isvalidate($email)
    {
        //$pass=md5($password);
        $builder = $this->db->table($this->adminTbl);
        $builder->where('email', $email);
        $builder->where('status', 1);
        $query = $builder->get();